// 进阶
export default {
  '/2-进阶技能/手写编程/': [
    {
      text: '手写编程',
      items: [
        {
          text: '不借助apply或bind实现call',
          link: '/2-进阶技能/手写编程/不借助apply或bind实现call',
        },
        {
          text: '手写pinia',
          link: '/2-进阶技能/手写编程/手写pinia',
        },
        {
          text: '手写迭代器、让对象可遍历',
          link: '/2-进阶技能/手写编程/手写迭代器、让对象可遍历',
        },
        {
          text: '手写防抖和节流',
          link: '/2-进阶技能/手写编程/手写防抖和节流',
        },
      ],
    },
  ],
  '/2-进阶技能/浏览器/': [
    {
      text: '浏览器',
      items: [
        {
          text: 'Post和Get请求的区别',
          link: '/2-进阶技能/浏览器/Post和Get请求的区别',
        },
        {
          text: '事件循环',
          link: '/2-进阶技能/浏览器/事件循环',
        },
      ],
    },
  ],
  '/2-进阶技能/算法/': [
    {
      text: '算法',
      items: [
        {
          text: '使用迭代器比较两个字符串大小',
          link: '/2-进阶技能/算法/使用迭代器比较两个字符串大小',
        },
        {
          text: '字符串倒序',
          link: '/2-进阶技能/算法/字符串倒序',
        },
        {
          text: '字符串数组的最长公共前缀',
          link: '/2-进阶技能/算法/字符串数组的最长公共前缀',
        },
        {
          text: '循环转递归的公式',
          link: '/2-进阶技能/算法/循环转递归的公式',
        },
        {
          text: '爬楼梯',
          link: '/2-进阶技能/算法/爬楼梯',
        },
        {
          text: '计算字符串每个字符出现的次数',
          link: '/2-进阶技能/算法/计算字符串每个字符出现的次数',
        },
      ],
    },
  ],
  '/2-进阶技能/编程技巧/': [
    {
      text: '编程技巧',
      items: [
        {
          text: '有父子属性的数组转换成树',
          link: '/2-进阶技能/编程技巧/有父子属性的数组转换成树',
        },
        {
          text: '手写深拷贝',
          link: '/2-进阶技能/编程技巧/手写深拷贝',
        },
      ],
    },
  ],
};
